[
{
    "id": 1,
    "nombre": "The Eye of the World",
    "precio": 8500,
    "descripcion": "En una pequeña aldea solitaria de la región de Dos Ríos vive Rand, un joven granjero, en compañía de su padre. Una noche son asaltados por trollocs, bestias semihumanas, que hieren al padre. Rand lo traslada al pueblo más cercano para que lo curen y comprueba que los trollocs también han ocasionado graves destrozos. Una poderosa maga, Moraine, afirma que Rand y otros dos muchachos deben huir de la aldea porque son el objetivo de la persecución de los trollocs, quienes obedecen a las fuerzas del mal.",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 800,
    "autor": "Robert Jordan",
    "tieneDescuento": true,
    "porcentajeDescuento": 0.10,
    "imagen": "../resources/img/products/theEyeOfTheWorld.png",
    "stock": 12,
    "isbn": "9780812511819",
    "formato": "tapa blanda",
    "saga": "The Wheel of Time",
    "sagaNumero": 1
},
{
    "id": 2,
    "nombre": "The Great Hunt",
    "precio": 8500,
    "descripcion": "¡Rand ha sobrevivido a su primer enfrentamiento con los perversos seguidores del Oscuro, pero ni sus amigos ni él están a salvo, ya que el señor del mal ha liberado a los Renegados, mientras los héroes de todas las eras se levantan de la tumba cuando el Cuerno de Valere los saca de su sueño. Al verse obligado a enfrentarse a las fuerzas de la oscuridad, Rand decide escapar de su destino. Pero la profecía tiene que cumplirse. Por su calidad literaria, su ambicioso planteamiento y su descomunal historia, La Rueda del Tiempo es la saga de fantasía más importante de los últimos treinta años. El lector que inicie el camino junto a Rand, Mat y Perrin no podrá abandonar el viaje hasta su incierto y sorprendente final.",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 705,
    "autor": "Robert Jordan",
    "tieneDescuento": true,
    "porcentajeDescuento": 0.10,
    "imagen": "../resources/img/products/theGreatHunt.png",
    "stock": 17,
    "isbn": "9780812517729",
    "formato": "tapa blanda",
    "saga": "The Wheel of Time",
    "sagaNumero": 2
},
{
    "id": 3,
    "nombre": "The Dragon Reborn",
    "precio": 8500,
    "descripcion": "El Dragón Renacido, el profético adalid que ha de salvar al mundo, el libertador que enloquecerá y matará a todos sus seres queridos, ha iniciado una carrera para huir de su destino. Rand al'Thor es capaz de entrar en contacto con el Poder Único, pero no puede controlarlo, ni tiene a nadie que le enseñe a hacerlo, pues ningún hombre lo ha conseguido desde hace tres mil años. Tiene la certidumbre de que ha de enfrentarse al Oscuro, pero ¿cómo? Perrin Aybara va en busca de Rand, acompañado por Moraine Sedai, su Guardián, Lan, y Olial el Ogier. Acosado por extraños sueños, Perrin afronta otro problema insoluble: ¿cómo eludir la pérdida de su propia condición humana?",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 624,
    "autor": "Robert Jordan",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/theDragonReborn.png",
    "stock": 15,
    "isbn": "9780765305114",
    "formato": "tapa blanda",
    "saga": "The Wheel of Time",
    "sagaNumero": "3"
},
{
    "id": 4,
    "nombre": "The Way of Kings",
    "precio": 9500,
    "descripcion": "En Roshar, un mundo de piedra y tormentas, extrañas tempestades de increíble potencia barren el rocoso territorio de tal manera que han dado forma a una nueva civilización escondida. Han pasado siglos desde la caída de las diez órdenes consagradas conocidas como los Caballeros Radiantes, pero sus espadas y armaduras aún permanecen. En las Llanuras Quebradas se libra una guerra sin sentido. Kaladin ha sido sometido a la esclavitud, mientras diez ejércitos luchan por separado contra un solo enemigo. El comandante de uno de los otros ejércitos, el señor Dalinar, se siente fascinado por un antiguo texto llamado 'El camino de los reyes'. Mientras tanto, al otro lado del océano, su eminente y hereje sobrina, Jasnah Kholin, forma a su discípula, la joven Shallan, quien investigará los secretos de los Caballeros Radiantes y la verdadera causa de la guerra.",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 1007,
    "autor": "Brandon Sanderson",
    "tieneDescuento": true,
    "porcentajeDescuento": 0.15,
    "imagen": "../resources/img/products/theWayOfKings.png",
    "stock": 32,
    "isbn": "9780765326355 ",
    "formato": "tapa dura",
    "saga": "The Stormlight Archive",
    "sagaNumero": 1
},
{
    "id": 5,
    "nombre": "Words of Radiance",
    "precio": 9500,
    "descripcion": "Palabras radiantes es la continuación de Camino de los reyes, la aclamada primera parte de la serie en diez volúmenes The Stormlight Archive. En ella retrocedemos seis años en el tiempo, cuando un asesino, entre cuyos primeros objetivos se halla Dalinar, mata al rey alezi. Kaladin está al mando de los guardaespaldas reales, un puesto controvertido por su baja condición, y debe proteger al rey y a Dalinar, al tiempo que dominar, en secreto, los nuevos y extraordinarios poderes vinculados a sus honorspren. Shallan tiene la misión de impedir el fin de las Desolaciones. Las Llanuras Quebradas tienen la respuesta; en ellas los parshendi están convencidos, gracias a su líder, de arriesgarlo todo en una apuesta desesperada...",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 1087,
    "autor": "Brandon Sanderson",
    "tieneDescuento": true,
    "porcentajeDescuento": 0.10,
    "imagen": "../resources/img/products/wordsOfRadiance.png",
    "stock": 27,
    "isbn": "9780765326362",
    "formato": "tapa dura",
    "saga": "The Stormlight Archive",
    "sagaNumero": 2
},
{
    "id": 6,
    "nombre": "Oathbringer",
    "precio": 9500,
    "descripcion": "La humanidad se enfrenta a una nueva Desolación con el regreso de los Portadores del Vacío, un enemigo tan grande en número como en sed de venganza. La victoria fugaz de los ejércitos alezi de Dalinar Kholin ha tenido consecuencias: el enemigo parshendi ha convocado la violenta tormenta eterna, que arrasa el mundo y hace que los hasta ahora pacíficos parshmenios descubran con horror que llevan un milenio esclavizados por los humanos. Al mismo tiempo, en una desesperada huida para alertar a su familia de la amenaza, Kaladin se pregunta si la repentina ira de los parshmenios está justificada.",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 1243,
    "autor": "Brandon Sanderson",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/oathbringer.png",
    "stock": 24,
    "isbn": "9780765326379",
    "formato": "tapa dura",
    "saga": "The Stormlight Archive",
    "sagaNumero": 3
},
{
    "id": 7,
    "nombre": "A Wizard of Earthsea",
    "precio": 7000,
    "descripcion": "En el mundo de Terramar hay dragones y espectros, talismanes y poderes, y las leyes de la magia son tan inevitables y exactas como las leyes naturales. Un principio fundamental rige en ese mundo: el delicado equilibrio entre la muerte y la vida, que muy pocos hombres pueden alterar o restaurar, pues la restauración del orden cósmico corresponde al individuo que se gobierna a sí mismo, el héroe completo capaz de dar el paso último, enfrentarse a su propia sombra, que es miedo, odio, inhumanidad. Ésta es la gran aventura iniciática de Ged, aprendiz de hechicero.",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 183,
    "autor": "Ursula K. Le Guin",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/aWizardOfEarthsea.png",
    "stock": 9,
    "isbn": "9780553383041",
    "formato": "tapa blanda",
    "saga": "Earthsea Cycle ",
    "sagaNumero": 1
},
{
    "id": 8,
    "nombre": "The Tombs of Atuan",
    "precio": 7000,
    "descripcion": "En el mundo de Terramar hay dragones y espectros, talismanes y poderes, y las leyes de la magia son tan inevitables y exactas como las leyes naturales. Un principio fundamental rige en ese mundo: el delicado equilibrio entre la muerte y la vida, que muy pocos hombres pueden alterar, o restaurar. Pues la restauración del orden cósmico corresponde naturalmente al individuo que se gobierna a sí mismo, el héroe completo capaz de dar el paso último, enfrentarse a su propia sombra, que es miedo, odio, inhumanidad.",
    "genero": "fantasia",
    "generoId": 3,
    "cantidadDePaginas": 180,
    "autor": "Ursula K. Le Guin",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/theTombsOfAtuan.png",
    "stock": 7,
    "isbn": "9780689845369",
    "formato": "tapa blanda",
    "saga": "Earthsea Cycle",
    "sagaNumero": 2
},
{
    "id": 9,
    "nombre": "Dune",
    "precio": 9000,
    "descripcion": "La historia se desarrolla alrededor del joven Paul Atreides, heredero del ducado de la Casa Atreides. Su padre, el duque Leto Atreides, recibe del Emperador Padishah Shaddam IV la orden de trasladarse, con todo su ducado, a Arrakis, la única fuente en el Universo Conocido de la especia melange. Paul debe enfrentarse a la traición del Emperador, temeroso de la ascendencia de la Casa Atreides en el Landsraad, y de la Casa Harkonnen, enemigos de los Atreides desde la Batalla de Corrin.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 658,
    "autor": "Frank Herbert",
    "tieneDescuento": true,
    "porcentajeDescuento": 0.15,
    "imagen": "../resources/img/products/dune.png",
    "stock": 7,
    "isbn": "9780593099322",
    "formato": "tapa dura",
    "saga": "Dune",
    "sagaNumero": 1
},
{
    "id": 10,
    "nombre": "Dune messiah",
    "precio": 9000,
    "descripcion": "Esta historia se centra en el nuevo Imperio Estelar Fremen, con la Bene Gesserit, la Cofradía Espacial, los Bene Tleilax, la princesa consorte Irulan Corrino y los Fremen rebeldes al Quizarato, que ven como el nuevo imperio diluye su cultura y costumbres ancestrales, en un complot para tomar el control del Imperio.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 337,
    "autor": "Frank Herbert",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/duneMessiah.png",
    "stock": 12,
    "isbn": "9780593098233",
    "formato": "tapa blanda",
    "saga": "Dune",
    "sagaNumero": 2
},
{
    "id": 11,
    "nombre": "Children of dune",
    "precio": 9000,
    "descripcion": "Nueve años después de la muerte de Chani, del final de la conspiración contra los Fremen, y de que el Emperador Paul Atreides, Muad'dib, ciego y solo, caminara hacia el desierto siguiendo la tradición fremen que aseguraba una muerte rápida, Alia, hermana de Paul y con poderes prescientes similares a los de su hermano, se ha casado con el ghola de Duncan Idaho y se sienta en el trono de Arrakis como Regente Imperial, así como tutora y guardiana de los gemelos nacidos en el momento de morir Chani: Leto y Ghanima.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 609,
    "autor": "Frank Herbert",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/childrenOfDune.png",
    "stock": 15,
    "isbn": "9780593098240",
    "formato": "tapa blanda",
    "saga": "Dune",
    "sagaNumero": 3
},
{
    "id": 12,
    "nombre": "Hyperion",
    "precio": 8500,
    "descripcion": "Siete personas se dirigen en Hyperion a una última peregrinación a su encuentro con el Alcaudón, considerado por algunos como una deidad y por otros como avatar de la inminente expiación humana. Todos ellos, portadores de historias increíbles y temibles secretos, muestran al contar sus historias, pinceladas del complejo universo desarrollado por Simmons y de una sociedad abocada a una lucha por su destino, a la que tal vez puedan salvar.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 500,
    "autor": "Dan Simmons",
    "tieneDescuento": true,
    "porcentajeDescuento": 0.10,
    "imagen": "../resources/img/products/hyperion.png",
    "stock": 19,
    "isbn": "9780553283686",
    "formato": "tapa blanda",
    "saga": "Hyperion Cantos",
    "sagaNumero": 1
},
{
    "id": 13,
    "nombre": "The fall of hyperion",
    "precio": 8500,
    "descripcion": "Después de varias horas de explorar las Tumbas del Tiempo en búsqueda del Alcaudón sin tener éxito, los peregrinos hacen un campamento cerca del artefacto conocido como la Esfinge. A partir de una terrible tormenta de arena, los peregrinos se van separando poco a poco para enfrentarse solos al Alcaudón.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 517,
    "autor": "Dan Simmons",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/theFallOfHyperion.png",
    "stock": 16,
    "isbn": "9780553288209",
    "formato": "tapa blanda",
    "saga": "Hyperion Cantos",
    "sagaNumero": 2
},
{
    "id": 14,
    "nombre": "Foundation",
    "precio": 8000,
    "descripcion": "Mucho tiempo después de que la Tierra pasara al olvido, la galaxia se unificó alrededor de un Imperio pacífico gobernado desde la majestuosa ciudad de Trántor. El sistema funcionó y prosperó durante incontables generaciones. Todo el mundo creía que duraría eternamente... Todos menos Hari Seldon, la mente científica más poderosa de su tiempo. Sus investigaciones en el campo de la psicohistoria (las matemáticas aplicadas a las grandes aglomeraciones humanas) auguraban un desastre imposible de prevenir. El Imperio estaba condenado... Pero el Plan Seldon era una estrategia a largo plazo, destinada a minimizar las peores consecuencias del futuro que se avecinaba. Para ello se establecieron dos Fundaciones en ambos extremos de la galaxia. Esta es la historia de la primera.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 244,
    "autor": "Isaac Asimov",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/fundation.png",
    "stock": 21,
    "isbn": "9780553803716",
    "formato": "tapa dura",
    "saga": "",
    "sagaNumero": 0
},
{
    "id": 15,
    "nombre": "Three body problem",
    "precio": 9000,
    "descripcion": "Durante la Revolución Cultural china, un proyecto militar secreto envía señales al espacio para contactar con extraterrestres. Pronto, una civilización alienígena al borde de la destrucción capta la señal y comienza a planear su desembarco en la Tierra. Durante las décadas siguientes, se comunica a través de un insólito método: un extraño videojuego virtual impregnado de historia y filosofía. Pero a medida que los alienígenas empiezan a ganar a los jugadores terrícolas, se forman distintos bandos, unos dispuestos a dar la bienvenida a esos seres superiores y ayudarlos a hacerse cargo de un mundo tan corrupto, y otros preparados para luchar contra la invasión. El resultado es una experiencia tan auténtica como reveladora sobre nuestro tiempo.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 400,
    "autor": "Liu Cixin",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/threeBodyProblem.png",
    "stock": 6,
    "isbn": "9780765377067",
    "formato": "tapa dura",
    "saga": "",
    "sagaNumero": 0
},
{
    "id": 16,
    "nombre": "Beggars in spain",
    "precio": 7000,
    "descripcion": "Año 2019. Una nueva especie de seres humanos, los Insomnes, disponen de mayor conocimiento y poder. Modificados por la ingeniería genética para no tener que dormir, los insomnes cuentan con más horas de actividad, no enferman nunca y son más longevos. Sus superdotados descendientes, los Superinsomnes, pueden desarrollar además una nueva biotecnología por la que aspiran a dominar el mundo. En el otro extremo de la sociedad se encuentran los Durmientes -los nuevos mendigos del futuro cercano-, cuyo recelo de los Insomnes es notorio, pues dependen de éstos para garantizar su propia supervivencia. En semejante contexto, tres personajes de diferente condición exponen su particular punto de vista sobre un conflicto que se intuye inminente e inevitable.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 400,
    "autor": "Nancy Kress",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/beggarsInSpain.png",
    "stock": 8,
    "isbn": "9780060733483",
    "formato": "tapa blanda",
    "saga": "",
    "sagaNumero": 0
},
{
    "id": 17,
    "nombre": "All systems red",
    "precio": 6500,
    "descripcion": "En un futuro controlado por entidades corporativas donde el viaje espacial es posible, una compañía de seguros debe aprobar y abastecer todas las misiones planetarias. Los equipos de exploración tienen que ir acompañados de androides suministrados por las aseguradoras, por su propio bien. Pero en una sociedad donde los contratos se conceden al postor más bajo, la seguridad no es lo más importante.",
    "genero": "ciencia ficcion",
    "generoId": 2,
    "cantidadDePaginas": 152,
    "autor": "Martha Wells",
    "tieneDescuento": false,
    "porcentajeDescuento": 0,
    "imagen": "../resources/img/products/allSystemsRed.png",
    "stock": 11,
    "isbn": "9780765397539",
    "formato": "bolsillo",
    "saga": "",
    "sagaNumero": 0
}
]